cf/AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОтношений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаОтношений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<BasedOn>
				<xr:Item>Document.ЧекККМ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СебестоимостьНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.СчетчикКупонов</xr:Item>
				<xr:Item>AccumulationRegister.РозничныеПродажи</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыПоБанковскимКартам</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиВРозницу</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПродажаВРозницу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПробития</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Купон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДСБух</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроведеноПоККТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромоКод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промокоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодарочныеКарты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Карта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПокупателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткудаПришел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОткудаПришел</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Купоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonModules/ДенежныеСредства/Ext/Module.bsl
Функция ПолучитьДолгПартнера(Контрагент, Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ СуммаОстаток СуммаДолга ИЗ РегистрНакопления.Взаиморасчеты.Остатки(, Контрагент = &Контрагент" +
	?(Организация <> Неопределено, " И Организация = &Организация", "") + ")");

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаДолга;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьДолгКонтрагента(Контрагент, Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ СуммаОстаток СуммаДолга ИЗ РегистрНакопления.Взаиморасчеты.Остатки(, Контрагент = &Контрагент" +
	?(Организация <> Неопределено, " И Организация = &Организация", "") + ")");

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаДолга;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции


Функция ПолучитьНаличностьВКассе(Касса, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 	СуммаОстаток Сумма
	|ИЗ			РегистрНакопления.ДенежныеСредства.Остатки(" + ?(Дата = Неопределено, "","&Дата") + ", Касса = &Касса)
	|");
	
	Запрос.УстановитьПараметр("Касса",	Касса);
	Запрос.УстановитьПараметр("Дата", 	Дата);
	
	Выполнение = Запрос.Выполнить();
	Если Выполнение.Пустой() Тогда
		
		Возврат 0;
		
	Иначе
		
		Выборка = Выполнение.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Сумма;
		
	КонецЕсли;
	
КонецФункции

Функция стрПолучитьПолучитьНаличностьВКассе(Касса, Дата = Неопределено) Экспорт
	
	Если Касса.Пустая() Тогда
		Возврат "";
	КонецЕсли;
	
	Сумма 	= ПолучитьНаличностьВКассе(Касса, Дата);
	Начало 	= ?(Дата = Неопределено, "в кассе: ", "на тот момент: ");
	
	Если Сумма Тогда
		
		Текст = Начало + Сумма + " " + Строка(Касса.ТипЦен.Валюта);
		
	ИначеЕсли Сумма < 0 Тогда
		
		Текст = Начало + "отрицательная сумма !!! " + Строка(Сумма);
		
	Иначе
		
		Текст = Начало + "небыло наличности";
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

#Область Заполнение_подразделения_отдела

Процедура ВытащитьОтделПодразделение(Объект, ДокОбъект, ОбъектВытаскивания, СтруктураСостава, СтруктураДокумента)
	
	Если 	СтруктураСостава.ЕстьПодразделение И
			СтруктураДокумента.ЕстьПодразделение И
			ДокОбъект.Подразделение.Пустая() И
			Не Объект.Подразделение.Пустая() Тогда
			
		ДокОбъект.Подразделение = ОбъектВытаскивания.Подразделение КонецЕсли;
	
	Если 	СтруктураСостава.ЕстьОтдел И
			СтруктураДокумента.ЕстьОтдел И
			ДокОбъект.Отдел.Пустая() И
			Не Объект.Отдел.Пустая() Тогда 
			
		ДокОбъект.Отдел = ОбъектВытаскивания.Отдел КонецЕсли;
	
КонецПроцедуры
Функция ОтделПодразделенияНеЗаполнен(ДокОбъект, СтруктураДокумента)
	
	Возврат (СтруктураДокумента.ЕстьОтдел И ДокОбъект.Отдел.Пустая()) Или (СтруктураДокумента.ЕстьПодразделение И ДокОбъект.Подразделение.Пустая());
	
КонецФункции
Процедура ВытащитьОтделПодразделениеВЗаданнойПоследовательности(ПосмотретьВ, Объект, ДокОбъект, Отработанные, СтруктураДокумента)
	
	Реквизиты = КонвертацияТипов.ПолучитьМассивИзСтроки(ПосмотретьВ);
	Для Каждого Реквизит Из Реквизиты Цикл
		Если ЕстьРеквизит(Объект.Метаданные(), Реквизит) Тогда
			
			СсылкаПроверяемого = Объект[Реквизит];
		
			Если ЗначениеЗаполнено(СсылкаПроверяемого) Тогда
				ВытащитьПодразделениеОтделРекурсивно(СсылкаПроверяемого, ДокОбъект, Отработанные, СтруктураДокумента);
				
				Если Не ОтделПодразделенияНеЗаполнен(ДокОбъект, СтруктураДокумента) Тогда
					Возврат; КонецЕсли; КонецЕсли; КонецЕсли; КонецЦикла;
	
КонецПроцедуры
Функция ЕстьРеквизит(Мета, ИмяРеквизита)
	
	Если  Мета.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат Истина;
	Иначе
		МетаОбщ = Метаданные.ОбщиеРеквизиты.Найти(ИмяРеквизита);
	
		Если МетаОбщ <> Неопределено Тогда  ОбщРекв = МетаОбщ.Состав.Найти(Мета);
			
			Возврат ОбщРекв <> Неопределено И ОбщРекв.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции
Процедура ВытащитьПодразделениеОтделРекурсивно(Объект, ДокОбъект, Отработанные, СтруктураДокумента)
	
	// Проверим может уже пробывали
	
	Если Отработанные[Объект] = Истина Или Не ОтделПодразделенияНеЗаполнен(ДокОбъект, СтруктураДокумента) Тогда Возврат; КонецЕсли;
	Отработанные.Вставить(Объект, Истина);
	
	// Заполним возможность проверки метаданных
	
	//Общ 	= Метаданные.ОбщиеРеквизиты;
	Мета 	= Объект.Метаданные();
	
	СтруктураСостава = Новый Структура("ЕстьОтдел, ЕстьПодразделение", ЕстьРеквизит(Мета, "Отдел"), ЕстьРеквизит(Мета, "Подразделение"));
	
	// Попробуем получит у текущего объекта
	
	ВытащитьОтделПодразделение(Объект, ДокОбъект, Объект, СтруктураСостава, СтруктураДокумента);
	
	// Если Отдел заполнили, а Подразделение нет, то вытащим Подразделение из Отдела
	
	Если  СтруктураДокумента.ЕстьОтдел И НЕ ДокОбъект.Отдел.Пустая() Тогда
		Если СтруктураДокумента.ЕстьПодразделение И ДокОбъект.Подразделение.Пустая() Тогда
			ДокОбъект.Подразделение = ДокОбъект.Отдел.Подразделение; КонецЕсли; КонецЕсли;
	
	// Если не получилось отправим вытаскивать дальше
	
	Если ОтделПодразделенияНеЗаполнен(ДокОбъект, СтруктураДокумента) Тогда
	
		стрОбъект = Объект.Метаданные().ПолноеИмя();
		ПоследПросмотра	= "";
		
		// Укажим какие реквизиты проверять впоисках подразделения и партнера
		
		Если стрНайти(стрОбъект, "Документ") = 1 Тогда 	
				Если стрОбъект = "Документ.ЧекККМ" ИЛИ (стрОбъект = "Документ.ЗаказПокупателя" И ДокОбъект.РозничнаяЗаявка) Тогда
					ПоследПросмотра = "Касса";	
				Иначе	
					ПоследПросмотра = "Контрагент, Партнер, Склад, Касса, Продавец"; // Это попытки просмотра у всех документов
				КонецЕсли;
		ИначеЕсли 	стрОбъект = "Справочник.Партнеры" Тогда 	ПоследПросмотра = "ОсновнойМенеджер";
		ИначеЕсли 	стрОбъект = "Справочник.Контрагенты" Тогда 	ПоследПросмотра = "Владелец"; КонецЕсли;
		
		Если Не ПустаяСтрока(ПоследПросмотра) Тогда
			ВытащитьОтделПодразделениеВЗаданнойПоследовательности(ПоследПросмотра, Объект, ДокОбъект, Отработанные, СтруктураДокумента); 
			
			// Исключительные свойства (когда ничего не помогло)
			
			Если стрОбъект = "Документ.ЧекККМ" И ДокОбъект.Отдел.Пустая() Тогда
				ДокОбъект.Отдел = Константы.ОтделВЧекеККМПоУмолчанию.Получить() КонецЕсли; КонецЕсли; КонецЕсли;
	
КонецПроцедуры
Процедура ПроверитьИПроставитьПодразделениеИОтдел(ДокОбъект) Экспорт
	
	// Проверяет заполнено или нет поля (подразделение и отдел) в документе и если нет тогда заполняет автоматически по алгоритму
	
	Отработанные 		= Новый Соответствие;
	Мета 				= ДокОбъект.Метаданные();
	СтруктураДокумента 	= Новый Структура("ЕстьОтдел, ЕстьПодразделение", ЕстьРеквизит(Мета, "Отдел"), ЕстьРеквизит(Мета, "Подразделение"));
	
	ВытащитьПодразделениеОтделРекурсивно(ДокОбъект, ДокОбъект, Отработанные, СтруктураДокумента);
	
КонецПроцедуры

#КонецОбласти
